hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/rf_noRtos_lib/inc/hw_ccfg.h
// Field:    [25] WRT_PROT_SEC_57
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_57                        0x02000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_57_BITN                           25
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_57_M                      0x02000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_57_S                              25

// Field:    [24] WRT_PROT_SEC_56
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_56                        0x01000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_56_BITN                           24
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_56_M                      0x01000000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_56_S                              24

// Field:    [23] WRT_PROT_SEC_55
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_55                        0x00800000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_55_BITN                           23
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_55_M                      0x00800000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_55_S                              23

// Field:    [22] WRT_PROT_SEC_54
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_54                        0x00400000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_54_BITN                           22
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_54_M                      0x00400000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_54_S                              22

// Field:    [21] WRT_PROT_SEC_53
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_53                        0x00200000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_53_BITN                           21
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_53_M                      0x00200000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_53_S                              21

// Field:    [20] WRT_PROT_SEC_52
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_52                        0x00100000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_52_BITN                           20
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_52_M                      0x00100000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_52_S                              20

// Field:    [19] WRT_PROT_SEC_51
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_51                        0x00080000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_51_BITN                           19
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_51_M                      0x00080000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_51_S                              19

// Field:    [18] WRT_PROT_SEC_50
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_50                        0x00040000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_50_BITN                           18
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_50_M                      0x00040000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_50_S                              18

// Field:    [17] WRT_PROT_SEC_49
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_49                        0x00020000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_49_BITN                           17
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_49_M                      0x00020000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_49_S                              17

// Field:    [16] WRT_PROT_SEC_48
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_48                        0x00010000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_48_BITN                           16
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_48_M                      0x00010000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_48_S                              16

// Field:    [15] WRT_PROT_SEC_47
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_47                        0x00008000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_47_BITN                           15
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_47_M                      0x00008000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_47_S                              15

// Field:    [14] WRT_PROT_SEC_46
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_46                        0x00004000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_46_BITN                           14
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_46_M                      0x00004000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_46_S                              14

// Field:    [13] WRT_PROT_SEC_45
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_45                        0x00002000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_45_BITN                           13
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_45_M                      0x00002000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_45_S                              13

// Field:    [12] WRT_PROT_SEC_44
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_44                        0x00001000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_44_BITN                           12
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_44_M                      0x00001000
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_44_S                              12

// Field:    [11] WRT_PROT_SEC_43
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_43                        0x00000800
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_43_BITN                           11
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_43_M                      0x00000800
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_43_S                              11

// Field:    [10] WRT_PROT_SEC_42
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_42                        0x00000400
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_42_BITN                           10
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_42_M                      0x00000400
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_42_S                              10

// Field:     [9] WRT_PROT_SEC_41
//
// 0: Sector protected
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_41                        0x00000200
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_41_BITN                            9
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_41_M                      0x00000200
#define CCFG_CCFG_PROT_63_32_WRT_PROT_SEC_41_S                               9

